alert("ขอให้ทุกคนมีวันที่น่ารักนะคั้บ (❁´◡`❁)")
const pic = ["image/a.jpg", "image/b.jpg", "image/c.jpg", "image/d.jpg", "image/e.jpg", "image/samathi.jpg","image/f.jpg"]
const predict = {
    "a": "โย่วววว เป็นยังไงบ้างคะช่วงนี้ เหนื่อยไหม วันนี้ทำได้ดีมาก ๆ เลยย เก่งที่สุดในใจซาเนีย ! (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧",
    "b": "ฮั่นแน่ ช่วงนี้มีเรื่องดี ๆ เข้ามาแน่เลย แต่ถ้าไม่มีก็ไม่เป็นไรหรอกนะโบร๋ว ยังไงวันดี ๆ ก็ต้องวิ่งเข้ามาหาเธอในซักวันแน่ ๆ",
    "c": "คือซาเนียจะบอกว่าอย่าฝืนเยอะนะ เธออย่าลืมว่าเธอยังมีคนคอยซัพพอร์ตอยู่ข้าง ๆ เสมอนะ จู้ ๆ ╰(*°▽°*)╯",
    "d": "เงินหมดหรอคะ ไม่เป็นไรนะ ซาเนียก็ไม่มีเงิน (´。＿。｀)",
    "e": "ถ้าเธอรู้สึกไม่ดี ไม่ต้องฝืนตัวเองนะคะ อยากร้องไห้ก็ร้องออกมาเลย การร้องไห้ไม่ใช่เรื่องไม่ดีนะ ! ซาเนียก็ร้องไห้บ่อยมาก ๆ เลยเหมือนกันน เพราะฉะนั้นไม่ต้องเก็บไว้หรอกนะ มีอะไรก็ลองเปิดใจคุยกับคนอื่น ๆ ดูนะ ♡",
    "samathi": "ซาเนียคิดว่าเธอหลุดสมาธิบ่อยนะช่วงนี้ พักผ่อนเยอะ ๆ นะ อย่าลืมกินข้าวให้ครบ 8 แก้ว นอนให้ครบ 3 มื้อ และดื่มน้ำให้ครบ 12 ชั่วโมงด้วยล่ะ เป็นห่วงคนอ่านมาก ๆ นะ ดูแลตัวเองดี ๆ ! (´▽`ʃ♡ƪ)",
    "f": "ฮัลโหลลล เธอเป็นยังไงบ้างคะช่วงนี้ อย่าลืมหาเวลาพักผ่อนให้ตัวเองแล้วออกไปเฮฮาปาร์ตี้กับเพื่อน ๆ นะ เพื่อนคิดถึงเธอแย่แล้ว"
    }
    const card = ["a","b", "c", "d", "e","samathi","f"]
    const random = "";
    window.onload = () => {
    const random = Math.floor(Math.random() * card.length);
    document.getElementById("cardPic").src = pic[random];
    document.getElementById("result").innerHTML = predict[card[random]];
    }
